ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/serial_api.c
/*
 * Copyright (c) 2013 Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this list
 *      of conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form, except as embedded into a Nordic Semiconductor ASA
 *      integrated circuit in a product or a software update for such product, must reproduce
 *      the above copyright notice, this list of conditions and the following disclaimer in
 *      the documentation and/or other materials provided with the distribution.
 *
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of its contributors may be
 *      used to endorse or promote products derived from this software without specific prior
 *      written permission.
 *
 *   4. This software, with or without modification, must only be used with a
 *      Nordic Semiconductor ASA integrated circuit.
 *
 *   5. Any software provided in binary or object form under this license must not be reverse
 *      engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "serial_api.h"

#if DEVICE_SERIAL

#include <string.h>
#include "mbed_assert.h"
#include "mbed_error.h"
#include "nrf_uart.h"
#include "nrf_drv_common.h"
#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "sdk_config.h"

#if defined(NRF52840_XXAA)
#define UART_INSTANCE_COUNT 2
#else
#define UART_INSTANCE_COUNT 1
#endif

#define UART_DEFAULT_BAUDRATE   UART_DEFAULT_CONFIG_BAUDRATE
#define UART_DEFAULT_PARITY     UART_DEFAULT_CONFIG_PARITY

// expected the macro from mbed configuration system
#ifndef MBED_CONF_NORDIC_UART_HWFC
    #define MBED_CONF_NORDIC_UART_HWFC 1
    #warning None of UART flow control configuration (expected macro MBED_CONF_NORDIC_UART_HWFC). The RTSCTS flow control is used by default .
#endif

#if MBED_CONF_NORDIC_UART_HWFC == 1
    #define UART_DEFAULT_HWFC       UART_DEFAULT_CONFIG_HWFC
#else
    #define UART_DEFAULT_HWFC  NRF_UART_HWFC_DISABLED
#endif

#define UART_DEFAULT_CTS        CTS_PIN_NUMBER
#define UART_DEFAULT_RTS        RTS_PIN_NUMBER

#ifdef NRF51
    #define NRFx_MBED_UART_IRQ_PRIORITY  APP_IRQ_PRIORITY_LOW
#elif defined(NRF52) || defined(NRF52840_XXAA)
    #define NRFx_MBED_UART_IRQ_PRIORITY  APP_IRQ_PRIORITY_LOWEST
#endif

// Required by "retarget.cpp".
int stdio_uart_inited = 0;
serial_t stdio_uart;

typedef struct {
    bool                initialized;
    uint32_t            irq_context;
    uart_irq_handler    irq_handler;

    uint32_t            pselrxd;
    uint32_t            pseltxd;
    uint32_t            pselcts;
    uint32_t            pselrts;
    nrf_uart_hwfc_t     hwfc;
    nrf_uart_parity_t   parity;
    nrf_uart_baudrate_t baudrate;

#if DEVICE_SERIAL_ASYNCH
    bool volatile       rx_active;
    uint8_t            *rx_buffer;
    size_t              rx_length;
    size_t              rx_pos;
    void              (*rx_asynch_handler)();
    uint8_t             char_match;

    bool volatile       tx_active;
    const uint8_t      *tx_buffer;
    size_t              tx_length;
    size_t              tx_pos;
    void              (*tx_asynch_handler)();

    uint32_t            events_wanted;
    uint32_t            events_occured;

    #define UART_IRQ_TX 1
    #define UART_IRQ_RX 2
    uint8_t             irq_enabled;
#endif // DEVICE_SERIAL_ASYNCH
} uart_ctlblock_t;

static uart_ctlblock_t uart_cb[UART_INSTANCE_COUNT];
static uint32_t uart_used[UART_INSTANCE_COUNT] = {0};

static void internal_set_hwfc(serial_t *obj, FlowControl type,
                             PinName rxflow, PinName txflow);


#if DEVICE_SERIAL_ASYNCH
static void end_asynch_rx(NRF_UART_Type *uart, int index)
{
    uart_ctlblock_t* UART_CB = &uart_cb[index]; 
    // If RX interrupt is activated for synchronous operations,
    // don't disable it, just stop handling it here.
    if (!(UART_CB->irq_enabled & UART_IRQ_RX)) {
        nrf_uart_int_disable(uart, NRF_UART_INT_MASK_RXDRDY);
    }
    UART_CB->rx_active = false;
}
static void end_asynch_tx(NRF_UART_Type *uart, int index)
{
    uart_ctlblock_t* UART_CB = &uart_cb[index]; 
    // If TX interrupt is activated for synchronous operations,
    // don't disable it, just stop handling it here.
    if (!(UART_CB->irq_enabled & UART_IRQ_TX)) {
        nrf_uart_int_disable(uart, NRF_UART_INT_MASK_TXDRDY);
    }
    UART_CB->tx_active = false;
}
#endif // DEVICE_SERIAL_ASYNCH

void uart_irq(NRF_UART_Type *uart, int index)
{
    uart_ctlblock_t* UART_CB = &uart_cb[index]; 
    if (nrf_uart_int_enable_check(uart, NRF_UART_INT_MASK_RXDRDY) &&
        nrf_uart_event_check(uart, NRF_UART_EVENT_RXDRDY)) {

    #if DEVICE_SERIAL_ASYNCH
        if (UART_CB->rx_active) {
            nrf_uart_event_clear(uart, NRF_UART_EVENT_RXDRDY);

            uint8_t rx_data = nrf_uart_rxd_get(uart);
            UART_CB->rx_buffer[UART_CB->rx_pos] = rx_data;

            bool end_rx = false;
            // If character matching should be performed, check if the current
            // data matches the given one.
            if (UART_CB->char_match != SERIAL_RESERVED_CHAR_MATCH &&
                rx_data == UART_CB->char_match) {
                // If it does, report the match and abort further receiving.
                UART_CB->events_occured |= SERIAL_EVENT_RX_CHARACTER_MATCH;
                if (UART_CB->events_wanted & SERIAL_EVENT_RX_CHARACTER_MATCH) {
                    end_rx = true;
                }
            }
            if (++UART_CB->rx_pos >= UART_CB->rx_length) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_COMPLETE;
                end_rx = true;
            }
            if (end_rx) {
                end_asynch_rx(uart, index);

                if (UART_CB->rx_asynch_handler) {
                    // Use local variable to make it possible to start a next
                    // transfer from callback routine.
                    void (*handler)() = UART_CB->rx_asynch_handler;
                    UART_CB->rx_asynch_handler = NULL;
                    handler();
                }
            }
        }
        else
    #endif

        if (UART_CB->irq_handler) {
            UART_CB->irq_handler(UART_CB->irq_context, RxIrq);
        }
    }

    if (nrf_uart_int_enable_check(uart, NRF_UART_INT_MASK_TXDRDY) &&
        nrf_uart_event_check(uart, NRF_UART_EVENT_TXDRDY)) {

