ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5/serial_api.c
    #if DEVICE_SERIAL_ASYNCH
        if (UART_CB->tx_active) {
            if (UART_CB->tx_pos < UART_CB->tx_length) {
                // When there is still something to send, clear the TXDRDY event
                // and put next byte to transmitter.
                nrf_uart_event_clear(uart, NRF_UART_EVENT_TXDRDY);
                nrf_uart_txd_set(uart,
                    UART_CB->tx_buffer[UART_CB->tx_pos]);
                UART_CB->tx_pos++;
            }
            else {
                // When the TXDRDY event is set after the last byte to be sent
                // has been passed to the transmitter, the job is done and TX
                // complete can be indicated.
                // Don't clear the TXDRDY event, it needs to remain set for the
                // 'serial_writable' function to work properly.
                end_asynch_tx(uart, index);

                UART_CB->events_occured |= SERIAL_EVENT_TX_COMPLETE;
                if (UART_CB->tx_asynch_handler) {
                    // Use local variable to make it possible to start a next
                    // transfer from callback routine.
                    void (*handler)() = UART_CB->tx_asynch_handler;
                    UART_CB->tx_asynch_handler = NULL;
                    handler();
                }
            }
        }
        else
    #endif

        if (UART_CB->irq_handler) {
            UART_CB->irq_handler(UART_CB->irq_context, TxIrq);
        }
    }

#if DEVICE_SERIAL_ASYNCH
    if (nrf_uart_event_check(uart, NRF_UART_EVENT_ERROR)) {
        nrf_uart_event_clear(uart, NRF_UART_EVENT_ERROR);

        uint8_t errorsrc = nrf_uart_errorsrc_get_and_clear(uart);
        if (UART_CB->rx_asynch_handler) {
            UART_CB->events_occured |= SERIAL_EVENT_ERROR;
            if (errorsrc & NRF_UART_ERROR_PARITY_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_PARITY_ERROR;
            }
            if (errorsrc & NRF_UART_ERROR_FRAMING_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_FRAMING_ERROR;
            }
            if (errorsrc & NRF_UART_ERROR_OVERRUN_MASK) {
                UART_CB->events_occured |= SERIAL_EVENT_RX_OVERRUN_ERROR;
            }
            UART_CB->rx_asynch_handler();
        }
    }
#endif // DEVICE_SERIAL_ASYNCH
}

void uart0_irq(void) { uart_irq(NRF_UART0, 0); }
#if defined(NRF52840_XXAA)
void uart1_irq(void) { uart_irq(NRF_UART1, 1); }
#endif

void serial_init(serial_t *obj, PinName tx, PinName rx) {

    if(uart_used[0] == 0 || UART_INSTANCE_COUNT == 1) {
        obj->serial.uart = NRF_UART0;
        obj->serial.instance = 0;
        obj->serial.IRQn = UART0_IRQn;
        NVIC_SetVector(UART0_IRQn, (uint32_t) uart0_irq);
    }
    else {
#if defined(NRF52840_XXAA)
        obj->serial.uart = NRF_UART1;
        obj->serial.instance = 1;
        obj->serial.IRQn = UART1_IRQn;
        NVIC_SetVector(UART1_IRQn, (uint32_t) uart1_irq);
#endif
    }
    uart_used[obj->serial.instance] = 1;
        
    uart_ctlblock_t* UART_CB = &uart_cb[obj->serial.instance]; 

    UART_CB->pseltxd =
        (tx == NC) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)tx;
    UART_CB->pselrxd =
        (rx == NC) ? NRF_UART_PSEL_DISCONNECTED : (uint32_t)rx;
    if (UART_CB->pseltxd != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_pin_set(UART_CB->pseltxd);
        nrf_gpio_cfg_output(UART_CB->pseltxd);
    }
    if (UART_CB->pselrxd != NRF_UART_PSEL_DISCONNECTED) {
        nrf_gpio_cfg_input(UART_CB->pselrxd, NRF_GPIO_PIN_NOPULL);
    }

    if (UART_CB->initialized) {
        // For already initialized peripheral it is sufficient to reconfigure
        // RX/TX pins only.

        // Ensure that there is no unfinished TX transfer.
        while (!serial_writable(obj)) {
        }
        // UART pins can be configured only when the peripheral is disabled.
        nrf_uart_disable(obj->serial.uart);
        nrf_uart_txrx_pins_set(obj->serial.uart, UART_CB->pseltxd, UART_CB->pselrxd);
        nrf_uart_enable(obj->serial.uart);
    }
    else {
        UART_CB->baudrate = UART_DEFAULT_BAUDRATE;
        UART_CB->parity   = UART_DEFAULT_PARITY;
        UART_CB->hwfc     = UART_DEFAULT_HWFC;
        UART_CB->pselcts  = UART_DEFAULT_CTS;
        UART_CB->pselrts  = UART_DEFAULT_RTS;

        nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_RXDRDY);
        nrf_uart_event_clear(obj->serial.uart, NRF_UART_EVENT_TXDRDY);
        nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTRX);
        nrf_uart_task_trigger(obj->serial.uart, NRF_UART_TASK_STARTTX);

        nrf_uart_int_disable(obj->serial.uart, NRF_UART_INT_MASK_RXDRDY |
                                            NRF_UART_INT_MASK_TXDRDY);
    #if DEVICE_SERIAL_ASYNCH
        nrf_uart_int_enable(obj->serial.uart, NRF_UART_INT_MASK_ERROR);
    #endif
        nrf_drv_common_irq_enable(obj->serial.IRQn, NRFx_MBED_UART_IRQ_PRIORITY);

        // TX interrupt needs to be signaled when transmitter buffer is empty,
        // so a dummy transmission is needed to get the TXDRDY event initially
        // set.
        nrf_uart_configure(obj->serial.uart,
            NRF_UART_PARITY_EXCLUDED, NRF_UART_HWFC_DISABLED);
        // Use maximum baud rate, so this dummy transmission takes as little
        // time as possible.
        nrf_uart_baudrate_set(obj->serial.uart, NRF_UART_BAUDRATE_1000000);
        // Perform it with disconnected TX pin, so nothing actually comes out
        // of the device.
        nrf_uart_txrx_pins_disconnect(obj->serial.uart);
        nrf_uart_hwfc_pins_disconnect(obj->serial.uart);
        nrf_uart_enable(obj->serial.uart);
        nrf_uart_txd_set(obj->serial.uart, 0);
        while (!nrf_uart_event_check(obj->serial.uart, NRF_UART_EVENT_TXDRDY)) {
        }
        nrf_uart_disable(obj->serial.uart);

        // Now everything is prepared to set the default configuration and
        // connect the peripheral to actual pins.
        nrf_uart_txrx_pins_set(obj->serial.uart, UART_CB->pseltxd, UART_CB->pselrxd);
        nrf_uart_baudrate_set(obj->serial.uart, UART_CB->baudrate);
        nrf_uart_configure(obj->serial.uart, UART_CB->parity, UART_CB->hwfc);
        if (UART_CB->hwfc == NRF_UART_HWFC_ENABLED) {
            internal_set_hwfc(obj, FlowControlRTSCTS,
                (PinName) UART_CB->pselrts, (PinName) UART_CB->pselcts);
        }

